src/src/InformationRegisters/TasksForUpdatingStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>TasksForUpdatingStatuses</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.GoodsReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.Quote</v8:Type>
						<v8:Type>cfg:DocumentRef.GoodsIssue</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/InformationRegisters/QuotationStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>QuotationStatuses</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QuotationStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Quote</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ObsoleteQuotation</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Quote</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/InformationRegisters/GoodsDocumentsStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>GoodsDocumentsStatuses</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GoodsDocumentStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GoodsReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.GoodsIssue</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/InformationRegisters/InvoicesPaymentStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>InvoicesPaymentStatuses</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.InvoicesPaymentStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/src/InformationRegisters/TasksForUpdatingStatuses/Ext/ManagerModule.bsl
#Region InfobaseUpdate

Procedure ProcessDataToUpgradeToNewVersion() Export
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	Quote.Ref AS Document
	|FROM
	|	Document.Quote AS Quote
	|		LEFT JOIN InformationRegister.QuotationStatuses AS QuotationStatuses
	|		ON Quote.Ref = QuotationStatuses.Document
	|WHERE
	|	QuotationStatuses.Document IS NULL
	|
	|UNION ALL
	|
	|SELECT
	|	GoodsReceipt.Ref
	|FROM
	|	Document.GoodsReceipt AS GoodsReceipt
	|		LEFT JOIN InformationRegister.GoodsDocumentsStatuses AS GoodsDocumentsStatuses
	|		ON GoodsReceipt.Ref = GoodsDocumentsStatuses.Document
	|WHERE
	|	GoodsDocumentsStatuses.Document IS NULL
	|
	|UNION ALL
	|
	|SELECT
	|	GoodsIssue.Ref
	|FROM
	|	Document.GoodsIssue AS GoodsIssue
	|		LEFT JOIN InformationRegister.GoodsDocumentsStatuses AS GoodsDocumentsStatuses
	|		ON GoodsIssue.Ref = GoodsDocumentsStatuses.Document
	|WHERE
	|	GoodsDocumentsStatuses.Document IS NULL
	|
	|UNION ALL
	|
	|SELECT
	|	SalesInvoice.Ref
	|FROM
	|	Document.SalesInvoice AS SalesInvoice
	|		LEFT JOIN InformationRegister.InvoicesPaymentStatuses AS InvoicesPaymentStatuses
	|		ON SalesInvoice.Ref = InvoicesPaymentStatuses.Document
	|WHERE
	|	InvoicesPaymentStatuses.Document IS NULL
	|
	|UNION ALL
	|
	|SELECT
	|	SupplierInvoice.Ref
	|FROM
	|	Document.SupplierInvoice AS SupplierInvoice
	|		LEFT JOIN InformationRegister.InvoicesPaymentStatuses AS InvoicesPaymentStatuses
	|		ON SupplierInvoice.Ref = InvoicesPaymentStatuses.Document
	|WHERE
	|	InvoicesPaymentStatuses.Document IS NULL";
	
	QueryResult = Query.Execute();
	Selection	= QueryResult.Select();
	
	While Selection.Next() Do
		RecordManager = InformationRegisters.TasksForUpdatingStatuses.CreateRecordManager();
		RecordManager.Document = Selection.Document;
		RecordManager.Write();
	EndDo;
	
EndProcedure

#EndRegion
